#include<stdio.h>
int main()
{
	int a[3][3];					/*定义3*3的二维数组a保存第一个矩阵*/
	int b[3][3];					/*定义3*3的二维数组b保存第二个矩阵*/
	int c[3][3]={0};				/*定义3*3的二维数组c保存结果矩阵，并给每个元素赋初值0*/
	int m,n,k;
	printf("请输入第一个矩阵：\n");	/*提示输入第一个矩阵*/
	for(m=0;m<3;++m)				/*读取数据，依次赋给数组a中的元素*/
	{
		for(n=0;n<3;++n)
		{
			scanf("%d",&a[m][n]);
		}
	}
	printf("请输入第二个矩阵：\n");	/*提示输入第二个矩阵*/
	for(m=0;m<3;++m)				/*读取数据，依次赋给数组b中的元素*/
	{
		for(n=0;n<3;++n)
		{
			scanf("%d",&b[m][n]);
		}
	}
	for(m=0;m<3;++m)				/*计算两矩阵乘积，将结果保存到数组c中*/
	{
		for(n=0;n<3;++n)
		{
			for(k=0;k<3;++k)
			{
				c[m][n]+=a[m][k]*b[k][n];
			}
		}
	}
	for(m=0;m<3;++m)				/*打印二维数组c的内容*/
	{
		for(n=0;n<3;++n)
		{
			printf("%d\t",c[m][n]);
		}
		printf("\n");				/*每行后面打印一个换行符*/
	}
	return 0;						/*程序结束*/
}